name: "sklearn-onnx"
platform: "onnxruntime_onnx"
max_batch_size: 8


input [
    {
        name: "X"
        data_type: TYPE_FP64
        dims: [ 4 ]
    }
]

output [
    {
        name: "label"
        data_type: TYPE_INT64
        dims: [ ]
    }
]

instance_group [
    {
        count: 6
        kind: KIND_CPU
    }
]

dynamic_batching: { max_queue_delay_microseconds: 500 }
